In [1]:
import pandas as pd

# Create a series

In [4]:
s = pd.Series(range(100))
s

0      0
1      1
2      2
3      3
4      4
      ..
95    95
96    96
97    97
98    98
99    99
Length: 100, dtype: int64

# Slice a series

In [5]:
s[:80]

0      0
1      1
2      2
3      3
4      4
      ..
75    75
76    76
77    77
78    78
79    79
Length: 80, dtype: int64

# Filter series squared brackets

In [12]:
s[s%5==0][s<50]

0      0
5      5
10    10
15    15
20    20
25    25
30    30
35    35
40    40
45    45
dtype: int64

In [20]:
s.where(lambda x: x%5==0).dropna()

0      0.0
5      5.0
10    10.0
15    15.0
20    20.0
25    25.0
30    30.0
35    35.0
40    40.0
45    45.0
50    50.0
55    55.0
60    60.0
65    65.0
70    70.0
75    75.0
80    80.0
85    85.0
90    90.0
95    95.0
dtype: float64

# Create a data frame

In [27]:
df = pd.DataFrame(s)
df.columns = ['Number']
df['twice'] = df['Number'] * 2
df

    Number  twice
0        0      0
1        1      2
2        2      4
3        3      6
4        4      8
..     ...    ...
95      95    190
96      96    192
97      97    194
98      98    196
99      99    198

[100 rows x 2 columns]

In [28]:
df[:80]

    Number  twice
0        0      0
1        1      2
2        2      4
3        3      6
4        4      8
..     ...    ...
75      75    150
76      76    152
77      77    154
78      78    156
79      79    158

[80 rows x 2 columns]

In [32]:
df[df['Number']%5==0][::2]

    Number  twice
0        0      0
10      10     20
20      20     40
30      30     60
40      40     80
50      50    100
60      60    120
70      70    140
80      80    160
90      90    180

In [33]:
df.where(lambda x: x['Number']%5==0).dropna()

    Number  twice
0      0.0    0.0
5      5.0   10.0
10    10.0   20.0
15    15.0   30.0
20    20.0   40.0
25    25.0   50.0
30    30.0   60.0
35    35.0   70.0
40    40.0   80.0
45    45.0   90.0
50    50.0  100.0
55    55.0  110.0
60    60.0  120.0
65    65.0  130.0
70    70.0  140.0
75    75.0  150.0
80    80.0  160.0
85    85.0  170.0
90    90.0  180.0
95    95.0  190.0